"""Наследование в питон"""

"""Дочерный класс наследуется от материнского класса"""

"""Наследование позваляет обявить класс который дублирует функцианальность уже существуюшего класса"""

"""Наследование - это одна из концепциый ооп"""

"""Особенность наследования заключается в том что оно позваляет не просто создавать дубликат класса но и расширить его функционал"""

"""Множественное наследование- это возможность класса иметь более одного родительского класса"""

"""При множественном наследовании дочерный класс наследует все свойства от родительского класса"""