#Инкапсуляция

"""Инкапсуляция это один из принципов ооп"""

"""Инкапсуляция используется как связь в ооп"""

"""А также используется как инструмент управления доступом"""

"""Инк. имеет 3 вида доступа"""

"""1.Public-данные достуным всем
   2.Private-данные доступные только обьекту-классу которому они пренадлежит
   3.Protect-зашишяет ваш обьект"""

#Нарушение инкапсуляции

"""Сам язык предоставляет программисту синтаксический инструмент, который может обойти инкапсуляцию.То есть читать и изменять переменные и вызывать функции все же возможно."""