#Обиектно-орентированное програмирование считается одной из самых эффективних методолигей

#В ООП мы создаем классы описоваюшие реально существующие предметы и ситуации, а затем создаете обьекты на основе этих описаный

#При создании класса определяется общее поведение для целой категории класса, после вы можете наделить каждый обьект класса уникальнимы спасобнастями на свой выбор

#Создание обьекта на основе класса називается созданием экземпляра таким образом вы работаете с экземпляром класса

#+ ООП

"""1. короткый код,2.код читабельный,3.на ооп легче делать изменения"""